// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

const num = Number(prompt("введи 1, 2, 3 або 4"));
let result;
if (num === 1) {
  result = "Зима";
} else if (num === 2) {
  result = "Весна";
} else if (num === 3) {
  result = "Літо";
} else if (num === 4) {
  result = "Осінь";
} else {
  result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
}
alert(result);
